#include "IO_FUNC.h"

/***********************************************************************************************
*函数名 ： void IO_init(void)
*函数功能描述 ： 初始化所有IO口为准双向模式
*函数返回值 ： void
*作者 ：WangR
*函数创建日期 ： 20190106
*函数修改日期 ： --
*修改人 ：--
*修改原因 ： --
*版本 ： 1.0
*历史版本 ： --
***********************************************************************************************/
void IO_init(void)
{
    P0M0 = 0xff;
    P0M1 = 0x00;
    P1M0 = 0xf3;
    P1M1 = 0x0c;
    P2M0 = 0xff;
    P2M1 = 0x00;
    P3M0 = 0xfc;
    P3M1 = 0x00;
    P4M0 = 0xff;
    P4M1 = 0x00;
    P5M0 = 0xff;
    P5M1 = 0x00;
    P6M0 = 0xff;
    P6M1 = 0x00;
    P7M0 = 0xff;
    P7M1 = 0x00;
		P1 &= 0XF3;
}